Examinator/src/InformationRegisters/ЛичныеСообщенияПользователейСУО/ЛичныеСообщенияПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеСообщенияПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтправительИлиПолучатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГрупповоеОбсуждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправленное</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПросмотрыЛентыНовостейПользователямиСУО/ПросмотрыЛентыНовостейПользователямиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПросмотрыЛентыНовостейПользователямиСУО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НовостиСУО/НовостиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НовостиСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/НовостьСУО/НовостьСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НовостьСУО</name>
  <registerRecords>InformationRegister.НовостиСУО</registerRecords>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonForms/ИнформационнаяЛентаСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЛичныйКабинетСУО") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// Устанавливаем переменные
	
	Пользователь = ?(ЗначениеЗаполнено(Параметры.Пользователь), Параметры.Пользователь, Пользователи.ТекущийПользователь());
	
	СформироватьЛенту();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура Подключаемый_НовостьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Документ.НовостьСУО.Форма.ФормаПросмотраНовости", Новый Структура("Новость", ЭтотОбъект[Элемент.Имя]));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВсеНовости(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.МоиНовостиСУО", Новый Структура("Все", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЛичныеСообщенияНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.ЛичныеСообщенияПользователейСУО.Форма.ЛичныеСообщения",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ФорумНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФорумСУО",,ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьИнформацию(Команда)
	СформироватьЛенту();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СформироватьЛенту()
	
	Если УправлениеДоступом.ЕстьРоль("ЛичныйКабинетИнформационнаяЛентаСУО") Тогда
	
		СформироватьЛентуНовостей();
		
	Иначе
		
		Элементы.ГруппаНовости.Видимость = Ложь;
		
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО")
		ИЛИ УправлениеДоступом.ЕстьРоль("ЛичныйКабинетСообщенияСУО")
		ИЛИ УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчастиеВФорумеСУО") Тогда
		
		СформироватьСсылкиНаСервисыОбщения();
		
	Иначе
		
		Элементы.ГруппаОбщение.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Пользователи.ТекущийПользователь() = Пользователь Тогда
		РегистрыСведений.ПросмотрыЛентыНовостейПользователямиСУО.ЗафиксироватьПросмотр(Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЛентуНовостей()
	
	// Удаляем старые реквизиты
	
	УдаляемыеРеквизиты   = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для НомерНовости = 1 По КоличествоНовостей Цикл
		УдаляемыеРеквизиты.Добавить("Новость" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерНовости));
		ЭлементФормы = Элементы.Найти("Новость" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерНовости));
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;
	
	ЭлементФормы = Элементы.Найти("ВсеНовости");
	
	Если ЭлементФормы <> Неопределено Тогда
		Элементы.Удалить(ЭлементФормы);	
	КонецЕсли;
	
	// Получаем список новостей
	
	Новости = РегистрыСведений.НовостиСУО.Новости(Пользователь, Ложь);
	
	Новости.Колонки.Добавить("ИмяРеквизита");
	
	Новости.Сортировать("Закрепить УБЫВ, ДатаПубликации УБЫВ");
	
	// Добавляем реквизиты
	
	НомерНовости = 0;
	
	Для каждого Строка Из Новости Цикл
		
		НомерНовости = НомерНовости + 1;
		
		Строка.ИмяРеквизита = "Новость" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерНовости);
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Строка.ИмяРеквизита,
									   Новый ОписаниеТипов("ДокументСсылка.НовостьСУО"),
									   "",
									   Формат(Строка.ДатаПубликации, "ДЛФ=D"),
									   Ложь)); 
		
		
	КонецЦикла;
	
	КоличествоНовостей = НомерНовости; // Запоминаем в реквизите 
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Добавляем элементы формы
	
	Для каждого Строка Из Новости Цикл
		
		ЭтотОбъект[Строка.ИмяРеквизита] = Строка.Новость;
		
		// Добавляем элемент формы, в котором будет отображаться оценка за задание
		ЭлементФормы = Элементы.Добавить(Строка.ИмяРеквизита,
										 Тип("ПолеФормы"),
										 Элементы.ГруппаНовости); 	
						  
		ЭлементФормы.ПутьКДанным = Строка.ИмяРеквизита;
	    ЭлементФормы.Гиперссылка = Истина;
		ЭлементФормы.Вид         = ВидПоляФормы.ПолеНадписи;
		
		Если Строка.Закрепить Тогда
			ЭлементФормы.Шрифт = Новый Шрифт(,,Истина);
		КонецЕсли;
		
		Если Строка.Выделить Тогда
			ЭлементФормы.ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_НовостьНажатие");
		
	КонецЦикла;
	
	// Добавляем элемент "Все новости"
	
	ЭлементФормы = Элементы.Добавить("ВсеНовости",
									 Тип("ДекорацияФормы"),
									 Элементы.ГруппаНовости); 	
					  
    ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.Заголовок = НСтр("ru = 'Все новости...'");
	
	ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ВсеНовости");
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСсылкиНаСервисыОбщения()
	
	// Если ПолучитьФункциональнуюОпцию("ИспользоватьУниверсальныйСервисОбщенияСУО") И УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО") Тогда
	//			
	//	КоличествоТемСНовымиСообщениями = РегистрыСведений.НастройкиТемОбщенияСУО.ПолучитьКоличествоТемСНовымиСообщениями(Пользователь);
	//	
	// КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЛичныеСообщенияСУО") И УправлениеДоступом.ЕстьРоль("ЛичныйКабинетСообщенияСУО") Тогда
		
		// Удаляем старый элемент
		
		ЭлементФормы = Элементы.Найти("ЛичныеСообщения");
		
		Если ЭлементФормы <> Неопределено Тогда
			Элементы.Удалить(ЭлементФормы);	
		КонецЕсли;
		
		КоличествоНовыхЛичныхСообщений = Документы.СообщениеСУО.КоличествоНовыхЛичныхСообщений(Пользователь);
		
		// Добавляем элемент формы, в котором будет отображаться ссылка на личные сообщения.
		
		ЭлементФормы = Элементы.Добавить("ЛичныеСообщения",
										 Тип("ДекорацияФормы"),
										 Элементы.ГруппаОбщение);
						  
	    ЭлементФормы.Гиперссылка = Истина;
		
		Если КоличествоНовыхЛичныхСообщений > 0  Тогда
			ЭлементФормы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Личные сообщения (%1)'"), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КоличествоНовыхЛичныхСообщений));
		Иначе
			ЭлементФормы.Заголовок = НСтр("ru = 'Личные сообщения'");
		КонецЕсли;
		
		ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ЛичныеСообщенияНажатие");
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьФорумыСУО") И УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчастиеВФорумеСУО") Тогда
		
		// Удаляем старый элемент
		
		ЭлементФормы = Элементы.Найти("Форум");
		
		Если ЭлементФормы <> Неопределено Тогда
			Элементы.Удалить(ЭлементФормы);	
		КонецЕсли;
		
		КоличествоСообщенийФорума = Документы.СообщениеСУО.КоличествоНовыхГрупповыхСообщений(Пользователь);
		
		// Добавляем элемент формы, в котором будет отображаться ссылка на личные сообщения.
		
		ЭлементФормы = Элементы.Добавить("Форум",
										 Тип("ДекорацияФормы"),
										 Элементы.ГруппаОбщение);
						  
		ЭлементФормы.Гиперссылка = Истина;
		
		Если КоличествоСообщенийФорума > 0  Тогда
			ЭлементФормы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Форум (%1)'"), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КоличествоСообщенийФорума));
		Иначе
			ЭлементФормы.Заголовок = НСтр("ru = 'Форум'");
		КонецЕсли;
		
		ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ФорумНажатие");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
